project/src/DataProcessors/ГрупповаяОбработкаЗахваченныхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ГрупповаяОбработкаЗахваченныхОбъектов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗахватаНачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗахватаКонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конвертация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конвертации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРаботы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗахватитьПОД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗахватитьПКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗахватитьПКПД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗахватитьАлгоритмы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗахватитьВсе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

project/src/Catalogs/СоставыКонвертаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>СоставыКонвертаций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Конвертации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭлементКонвертации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаКонвертацииПредопределенныхДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаКонвертацииОбъектов</v8:Type>
						<v8:Type>cfg:CatalogRef.Алгоритмы</v8:Type>
						<v8:Type>cfg:CatalogRef.Запросы</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбработкиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/DataProcessors/ГрупповаяОбработкаЗахваченныхОбъектов/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Константы.СовместнаяРабота.Получить() = Ложь Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	Если Параметры.Свойство("ЗахваченныеОбъекты") Тогда
		ВызовИзФормыСписка = Истина;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ИСТИНА КАК Пометка,
		|	ДанныеЗахвата.Объект,
		|	ДанныеЗахвата.Пользователь,
		|	ДанныеЗахвата.Период КАК ДатаЗахвата
		|ИЗ РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних(,
		|	Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПриСовместнойРаботе.Захват)
		|	И Объект.Захвачен = ИСТИНА) КАК ДанныеЗахвата
		|ГДЕ ДанныеЗахвата.Объект В (&ЗахваченныеОбъекты)
		|";
		Запрос.УстановитьПараметр("ЗахваченныеОбъекты", Параметры.ЗахваченныеОбъекты);
		ЗахваченныеОбъекты.Загрузить(ЗАпрос.Выполнить().Выгрузить());
		Элементы.ЗахваченныеОбъектыОбновитьСписок.Доступность = Ложь;
		Элементы.ГруппаОтбор.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВариантРаботыПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ЗахватитьВсеПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ОбновитьСписокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Команда)
	Если ЗахваченныеОбъекты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ИзменитьПометкуНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	Если ЗахваченныеОбъекты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ИзменитьПометкуНаСервере(Ложь);
КонецПроцедуры  

&НаКлиенте
Процедура СнятьЗахватСЗаписью(Команда)
	Если ЗахваченныеОбъекты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	РежимОтменитьЗахват = Ложь;
	ОбработатьЗахваченныеОбъектыКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗахват(Команда)
	Если ЗахваченныеОбъекты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	РежимОтменитьЗахват = Истина;
	ОбработатьЗахваченныеОбъектыКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗахват(Команда)
	Если Не ЗначениеЗаполнено(Объект.Конвертация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не заполнена конвертация'"));
		Возврат;
	КонецЕсли;
	Если НЕ (Объект.ЗахватитьАлгоритмы Или Объект.ЗахватитьВсе Или Объект.ЗахватитьПКО Или Объект.ЗахватитьПКПД Или Объект.ЗахватитьПОД) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбраны объекты для захвата'"));
		Возврат;
	КонецЕсли;
	ОбработатьЗахваченныеОбъектыКлиент();
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимость()
	Элементы.Основная.Видимость = Истина;
	Элементы.Ожидание.Видимость = Ложь;
	Элементы.ГруппаЗахват.Видимость = Объект.ВариантРаботы;
	Элементы.ГруппаОтменаЗахвата.Видимость = НЕ Объект.ВариантРаботы;
	Элементы.Комментарий.Видимость = НЕ Объект.ВариантРаботы;
	Если Объект.ВариантРаботы Тогда
		Если Объект.ЗахватитьВсе Тогда
			Объект.ЗахватитьАлгоритмы = Ложь;
			Объект.ЗахватитьПКО = Ложь;
			Объект.ЗахватитьПКПД = Ложь;
			Объект.ЗахватитьПОД = Ложь;
		КонецЕсли;
		Элементы.ЗахватитьАлгоритмы.Доступность = НЕ Объект.ЗахватитьВсе;
		Элементы.ЗахватитьПКО.Доступность = НЕ Объект.ЗахватитьВсе;
		Элементы.ЗахватитьПКПД.Доступность = НЕ Объект.ЗахватитьВсе;
		Элементы.ЗахватитьПОД.Доступность = НЕ Объект.ЗахватитьВсе;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗахваченныеОбъектыКлиент()
	Элементы.Комментарий.Видимость = Ложь;
	Элементы.Основная.Видимость = Ложь;
	Элементы.Ожидание.Видимость = Истина;
	ПодключитьОбработчикОжидания("ЗапускОбработки", 5, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗапускОбработки()
	ОбработатьЗахваченныеОбъекты();
	ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 5, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияДлительнойОперации()
	Если НЕ ДлительнаяОперация Тогда
		Элементы.Комментарий.Видимость = Истина;
		Элементы.Основная.Видимость = Истина;
		Элементы.Ожидание.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	Если ДлительнаяОперацияВыполнена() Тогда
		ДлительнаяОперация = Ложь;
		ПодключитьОбработчикОжидания("ОкончаниеОтменыЗахвата", 1, Истина);
	Иначе
		ПодключитьОбработчикОжидания("ОбработчикОжиданияДлительнойОперации", 5, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДлительнаяОперацияВыполнена()
	Если ИдентификаторЗадания = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
КонецФункции

&НаКлиенте
Процедура ОкончаниеОтменыЗахвата()
	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилищаРезультата);
	Если Объект.ВариантРаботы Тогда
		Действие = НСтр("ru='Захват объектов'");
	Иначе
		Действие = ?(РежимОтменитьЗахват, НСтр("ru='Отмена захвата'"), НСтр("ru='Снятие захвата с записью объектов'"));
	КонецЕсли;

	РезультатСтрокой = ?(РезультатВыполнения.Успешно, НСтр("ru='завершено успешно.'"), НСтр("ru='не выполнено.'"));
	ОбщегоНазначенияКлиент.СообщитьПользователю(Действие + " " + РезультатСтрокой);
	Элементы.Основная.Видимость = Истина;
	Элементы.Ожидание.Видимость = Ложь;
	Если ВызовИзФормыСписка Тогда
		Закрыть();
	КонецЕсли;
	Оповестить("ИзмененСтатусЗахвата", Ложь);
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗахваченныеОбъекты()
	ИдентификаторЗадания = Неопределено;
	ДлительнаяОперация = Ложь;
	АдресХранилищаРезультата = Неопределено;
	Если Объект.ВариантРаботы Тогда
		// Захват новых
		ИмяПроцедуры = "Обработки.ГрупповаяОбработкаЗахваченныхОбъектов.ВыполнитьОбработкуЗахват";
		НаименованиеФЗ = НСтр("ru = 'Групповой захват объектов'");
		СтруктураПараметров = Новый Структура("Конвертация, ЗахватитьВсе",
						Объект.Конвертация, Объект.ЗахватитьВсе);
		Если НЕ Объект.ЗахватитьВсе Тогда
			СтруктураПараметров.Вставить("ЗахватитьПОД", Объект.ЗахватитьПОД);
			СтруктураПараметров.Вставить("ЗахватитьПКО", Объект.ЗахватитьПКО);
			СтруктураПараметров.Вставить("ЗахватитьПКПД", Объект.ЗахватитьПКПД);
			СтруктураПараметров.Вставить("ЗахватитьАлгоритмы", Объект.ЗахватитьАлгоритмы);
		КонецЕсли;
	Иначе
		СтруктураПараметров = Новый Структура("РежимОтменитьЗахват, ЗахваченныеОбъекты, Комментарий",
						РежимОтменитьЗахват, ЗахваченныеОбъекты.Выгрузить(), Комментарий);
		ИмяПроцедуры = "Обработки.ГрупповаяОбработкаЗахваченныхОбъектов.ВыполнитьОбработкуОтменаЗахвата";
		НаименованиеФЗ = НСтр("ru = 'Групповая обработка захваченных объектов'");
	КонецЕсли;
	Попытка
		ПараметрыФоновогоЗадания = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыФоновогоЗадания.НаименованиеФоновогоЗадания = НаименованиеФЗ;
		ПараметрыФоновогоЗадания.ЗапуститьВФоне = Истина;
		Результат = ДлительныеОперации.ВыполнитьВФоне(ИмяПроцедуры, СтруктураПараметров, ПараметрыФоновогоЗадания);
		АдресХранилищаРезультата = Результат.АдресРезультата;
		Если Результат.Статус = "Выполнено" Тогда
			РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилищаРезультата);
			Если  Объект.ВариантРаботы Тогда
				Действие = НСтр("ru='Захват объектов'");
			Иначе
				Действие = ?(РежимОтменитьЗахват, НСтр("ru='Отмена захвата'"), НСтр("ru='Снятие захвата с записью объектов'"));
			КонецЕсли;
			РезультатСтрокой = ?(РезультатВыполнения.Успешно, НСтр("ru='завершено успешно.'"), НСтр("ru='не выполнено.'"));
			ОбщегоНазначения.СообщитьПользователю(Действие + " " + РезультатСтрокой);
		Иначе
			ДлительнаяОперация = Истина;
			ИдентификаторЗадания = Результат.ИдентификаторЗадания;
		КонецЕсли;
	Исключение
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'При выполнении операции произошла ошибка'") + Символы.ПС + ОписаниеОшибки());
		Возврат;
	КонецПопытки  
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДанныеЗахвата.Объект,
	|	ДанныеЗахвата.Пользователь,
	|	ДанныеЗахвата.Период КАК ДатаЗахвата
	|ИЗ РегистрСведений.СовместнаяРаботаСОбъектами.СрезПоследних(,
	|	Действие = ЗНАЧЕНИЕ(Перечисление.ДействияПриСовместнойРаботе.Захват)
	|	И Объект.Захвачен = ИСТИНА) КАК ДанныеЗахвата
	|%СоединениеСостав%
	|ГДЕ (Пользователь = &Пользователь ИЛИ &ПользовательПуст)
	|	И (Период >=&ДатаНач ИЛИ &ДатаНачПуста)
	|	И (Период <=&ДатаКон ИЛИ &ДатаКонПуста)
	|	%УсловиеСостав%
	|";
	Запрос.УстановитьПараметр("Пользователь", Объект.Пользователь);
	Запрос.УстановитьПараметр("ПользовательПуст", НЕ ЗначениеЗаполнено(Объект.Пользователь));
	Запрос.УстановитьПараметр("ДатаНач", Объект.ДатаЗахватаНачалоПериода);
	Запрос.УстановитьПараметр("ДатаНачПуста", НЕ ЗначениеЗаполнено(Объект.ДатаЗахватаНачалоПериода));
	Запрос.УстановитьПараметр("ДатаКон", Объект.ДатаЗахватаКонецПериода);
	Запрос.УстановитьПараметр("ДатаКонПуста", НЕ ЗначениеЗаполнено(Объект.ДатаЗахватаКонецПериода));
	Если ЗначениеЗаполнено(Объект.Конвертация) Тогда
		Запрос.УстановитьПараметр("Конвертация", Объект.Конвертация);

		СоединениеСостав = "ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СоставыКонвертаций КАК Состав
		|ПО  ДанныеЗахвата.Объект = Состав.ЭлементКонвертации
		|	И Состав.Владелец = &Конвертация";
		УсловиеСостав = "И Состав.Отключить = ЛОЖЬ";
	Иначе
		СоединениеСостав = "";
		УсловиеСостав = "";
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%СоединениеСостав%", СоединениеСостав);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеСостав%", УсловиеСостав);


	ТабОбъекты = Запрос.Выполнить().Выгрузить();
	ЗахваченныеОбъекты.Очистить();
	ЗахваченныеОбъекты.Загрузить(ТабОбъекты);
КонецПроцедуры

&НаСервере
Процедура ИзменитьПометкуНаСервере(НоваяПометка)
	Для Каждого Строка Из ЗахваченныеОбъекты Цикл
		Строка.Пометка = НоваяПометка;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
